--- a/test/__snapshots__/contracts/mappings/public-mapping.snap.md
+++ b/test/__snapshots__/contracts/mappings/public-mapping.snap.md
@@ -103,112 +103,164 @@ object "runtime" {
 
 ```
 
-```graphviz -no-opt
-digraph G {    
-  color="#efefef";
-  graph[fontsize=8];
-
-  node[shape=box style="rounded,filled" fontsize=9 fontname="Arial" fillcolor="#efefef"];
-
-  subgraph cluster_0 {
-    style="filled,rounded";
-    label = "pc @0";
-    "id-0" [label="pc @0 (id-0)\l=| local0\lmemory[0x40] = 0x80;\lundefined local0 = msg.value; // #refs 0\lwhen msg.value == 0 goto 16 or fall 12\l" fillcolor="#cf91f7"];
-  }
-
-  subgraph cluster_12 {
-    style="filled,rounded";
-    label = "pc @12";
-    "id-1" [label="pc @12 (id-1)\l=| local0\lundefined local1 = 0x0; // #refs 0\lrevert();\l" fillcolor="#cf91f7"];
-  }
-
-  subgraph cluster_16 {
-    style="filled,rounded";
-    label = "pc @16";
-    "id-2" [label="pc @16 (id-2)\l=| \lwhen msg.data.length < 0x4 goto 54 or fall 26\l" fillcolor="#cf91f7"];
-  }
-
-  subgraph cluster_26 {
-    style="filled,rounded";
-    label = "pc @26";
-    "id-3" [label="pc @26 (id-3)\l=| local1\lundefined local1 = msg.data >>> 0xe0; // #refs 1\lcase when msg.sig == 20965255 goto [J]0x3b or fall 43\l" fillcolor="#cf91f7"];
-  }
-
-  subgraph cluster_43 {
-    style="filled,rounded";
-    label = "pc @43";
-    "id-4" [label="pc @43 (id-4)\l=| local1\lcase when msg.sig == dd62ed3e goto [J]0x59 or fall 54\l" fillcolor="#cf91f7"];
-  }
-
-  subgraph cluster_54 {
-    style="filled,rounded";
-    label = "pc @54";
-    "id-5" [label="pc @54 (id-5)\l=| local1\lundefined local2 = 0x0; // #refs 0\lrevert();\l" fillcolor="#cf91f7"];
-    "id-6" [label="pc @54 (id-6)\l=| \lundefined local1 = 0x0; // #refs 0\lrevert();\l" fillcolor="#cf91f7"];
-  }
-
-  subgraph cluster_59 {
-    style="filled,rounded";
-    label = "pc @59";
-    "id-7" [label="pc @59 (id-7)\l=| [J]0x43|local1\lgoto :[J]0xd1 branch:209\l" fillcolor="#cf91f7"];
-  }
-
-  subgraph cluster_209 {
-    style="filled,rounded";
-    label = "pc @209";
-    "id-8" [label="pc @209 (id-8)\l=| sload(keccak256(0x0, add(0x20, local6) /*caller().keccak256(0x0, add(0x20, local4) /*caller().0x0*/)*/)/*base0[caller()][caller()]*/)|local1\lundefined local2 = 0x0; // #refs -1\lundefined local3 = 0x0; // #refs -1\lmemory[0x0] = 0xffffffffffffffffffffffffffffffffffffffff & 0xffffffffffffffffffffffffffffffffffffffff & msg.sender;\lundefined local4 = 0x20 + 0x0; // #refs -1\lmemory[0x20 + 0x0] = 0x0;\lundefined local5 = 0x0; // #refs -1\lmemory[0x0] = 0xffffffffffffffffffffffffffffffffffffffff & 0xffffffffffffffffffffffffffffffffffffffff & msg.sender;\lundefined local6 = 0x20 + 0x0; // #refs -1\lmemory[0x20 + 0x0] = keccak256(msg.sender, 0x0);\lgoto :[J]0x43 branch:67\l" fillcolor="#cf91f7"];
-  }
-
-  subgraph cluster_67 {
-    style="filled,rounded";
-    label = "pc @67";
-    "id-9" [label="pc @67 (id-9)\l=| local1\lundefined local7 = memory[0x40]; // #refs 0\lundefined local8 = allowance[msg.sender][msg.sender]; // #refs -1\lmemory[memory[0x40]] = allowance[msg.sender][msg.sender];\lundefined local9 = memory[0x40]; // #refs 0\lreturn allowance[msg.sender][msg.sender];\l" fillcolor="#cf91f7"];
-  }
-
-  subgraph cluster_89 {
-    style="filled,rounded";
-    label = "pc @89";
-    "id-10" [label="pc @89 (id-10)\l=| local3|local2|[J]0xbb|local1\lundefined local2 = 0x4; // #refs 3\lundefined local3 = msg.data.length - local2; // #refs 0\lwhen (msg.data.length - local2 < 0x40) == 0 goto 111 or fall 107\l" fillcolor="#cf91f7"];
-  }
-
-  subgraph cluster_107 {
-    style="filled,rounded";
-    label = "pc @107";
-    "id-11" [label="pc @107 (id-11)\l=| local3|local2|[J]0xbb|local1\lundefined local4 = 0x0; // #refs 0\lrevert();\l" fillcolor="#cf91f7"];
-  }
-
-  subgraph cluster_111 {
-    style="filled,rounded";
-    label = "pc @111";
-    "id-12" [label="pc @111 (id-12)\l=| and(0xffffffffffffffffffffffffffffffffffffffff, calldataload(local4))|and(0xffffffffffffffffffffffffffffffffffffffff, calldataload(local2))|[J]0xbb|local1\lundefined local4 = 0x20 + local2; // #refs 0\lgoto :[J]0x154 branch:340\l" fillcolor="#cf91f7"];
-  }
-
-  subgraph cluster_340 {
-    style="filled,rounded";
-    label = "pc @340";
-    "id-13" [label="pc @340 (id-13)\l=| sload(keccak256(0x0, 0x40 /*calldataload(0x24).keccak256(0x0, 0x40 /*calldataload(0x4).0x0*/)*/)/*base0[calldataload(0x4)][calldataload(0x24)]*/)|local7|local1\lmemory[0x20] = 0x0;\lundefined local5 = 0xffffffffffffffffffffffffffffffffffffffff & msg.data[local2]; // #refs -1\lmemory[0x0] = 0xffffffffffffffffffffffffffffffffffffffff & msg.data[local2];\lmemory[0x20] = keccak256(_arg0, 0x0);\lundefined local6 = 0xffffffffffffffffffffffffffffffffffffffff & msg.data[0x20 + local2]; // #refs -1\lmemory[0x0] = 0xffffffffffffffffffffffffffffffffffffffff & msg.data[0x20 + local2];\lundefined local7 = [J]0xbb; // #refs 0\lgoto :[J]0xbb branch:187\l" fillcolor="#cf91f7"];
-  }
-
-  subgraph cluster_187 {
-    style="filled,rounded";
-    label = "pc @187";
-    "id-14" [label="pc @187 (id-14)\l=| local7|local1\lundefined local8 = memory[0x40]; // #refs 0\lundefined local9 = allowance[_arg0][_arg1]; // #refs -1\lmemory[memory[0x40]] = allowance[_arg0][_arg1];\lundefined local10 = memory[0x40]; // #refs 0\lreturn allowance[_arg0][_arg1];\l" fillcolor="#cf91f7"];
-  }
-
-  "id-0" -> "id-2";
-  "id-0" -> "id-1";
-  "id-2" -> "id-6";
-  "id-2" -> "id-3";
-  "id-3" -> "id-4";
-  "id-4" -> "id-5";
-  "id-7" -> "id-8";
-  "id-8" -> "id-9";
-  "id-10" -> "id-12";
-  "id-10" -> "id-11";
-  "id-12" -> "id-13";
-  "id-13" -> "id-14";
-
-}
+```mermaid -no-opt
+---
+title: public mapping-no-opt
+---
+flowchart TD
+  classDef state text-align:left
+  subgraph cluster_0 [pc @0]
+    s_0[["pc @0 (s_0)
+=|local0
+memory[0x40] = 0x80;
+undefined local0 = msg.value; // #refs 0
+when msg.value == 0 goto 16 or fall 12
+"]]
+    class s_0 state
+    style s_0 fill:#471C21
+  end
+  subgraph cluster_12 [pc @12]
+    s_1("pc @12 (s_1)
+=|local0
+undefined local1 = 0x0; // #refs 0
+revert();
+")
+    class s_1 state
+  end
+  subgraph cluster_16 [pc @16]
+    s_2("pc @16 (s_2)
+=|
+when msg.data.length < 0x4 goto 54 or fall 26
+")
+    class s_2 state
+  end
+  subgraph cluster_26 [pc @26]
+    s_3("pc @26 (s_3)
+=|local1
+undefined local1 = msg.data >>> 0xe0; // #refs 1
+case when msg.sig == 20965255 goto [J]0x3b or fall 43
+")
+    class s_3 state
+  end
+  subgraph cluster_43 [pc @43]
+    s_4("pc @43 (s_4)
+=|local1
+case when msg.sig == dd62ed3e goto [J]0x59 or fall 54
+")
+    class s_4 state
+  end
+  subgraph cluster_54 [pc @54]
+    s_5("pc @54 (s_5)
+=|local1
+undefined local2 = 0x0; // #refs 0
+revert();
+")
+    class s_5 state
+    s_6("pc @54 (s_6)
+=|
+undefined local1 = 0x0; // #refs 0
+revert();
+")
+    class s_6 state
+  end
+  subgraph cluster_59 [pc @59]
+    s_7[["pc @59 (s_7)
+=|[J]0x43|local1
+goto :[J]0xd1 branch:209
+"]]
+    class s_7 state
+    style s_7 fill:#5F021F
+  end
+  subgraph cluster_209 [pc @209]
+    s_8("pc @209 (s_8)
+=|sload(keccak256(0x0, add(0x20, local6) /*caller().keccak256(0x0, add(0x20, local4) /*caller().0x0*/)*/)/*base0[caller()][caller()]*/)|local1
+undefined local2 = 0x0; // #refs -1
+undefined local3 = 0x0; // #refs -1
+memory[0x0] = 0xffffffffffffffffffffffffffffffffffffffff & 0xffffffffffffffffffffffffffffffffffffffff & msg.sender;
+undefined local4 = 0x20 + 0x0; // #refs -1
+memory[0x20 + 0x0] = 0x0;
+undefined local5 = 0x0; // #refs -1
+memory[0x0] = 0xffffffffffffffffffffffffffffffffffffffff & 0xffffffffffffffffffffffffffffffffffffffff & msg.sender;
+undefined local6 = 0x20 + 0x0; // #refs -1
+memory[0x20 + 0x0] = keccak256(msg.sender, 0x0);
+goto :[J]0x43 branch:67
+")
+    class s_8 state
+  end
+  subgraph cluster_67 [pc @67]
+    s_9("pc @67 (s_9)
+=|local1
+undefined local7 = memory[0x40]; // #refs 0
+undefined local8 = allowance[msg.sender][msg.sender]; // #refs -1
+memory[memory[0x40]] = allowance[msg.sender][msg.sender];
+undefined local9 = memory[0x40]; // #refs 0
+return allowance[msg.sender][msg.sender];
+")
+    class s_9 state
+  end
+  subgraph cluster_89 [pc @89]
+    s_10[["pc @89 (s_10)
+=|local3|local2|[J]0xbb|local1
+undefined local2 = 0x4; // #refs 3
+undefined local3 = msg.data.length - local2; // #refs 0
+when (msg.data.length - local2 < 0x40) == 0 goto 111 or fall 107
+"]]
+    class s_10 state
+    style s_10 fill:#5F021F
+  end
+  subgraph cluster_107 [pc @107]
+    s_11("pc @107 (s_11)
+=|local3|local2|[J]0xbb|local1
+undefined local4 = 0x0; // #refs 0
+revert();
+")
+    class s_11 state
+  end
+  subgraph cluster_111 [pc @111]
+    s_12("pc @111 (s_12)
+=|and(0xffffffffffffffffffffffffffffffffffffffff, calldataload(local4))|and(0xffffffffffffffffffffffffffffffffffffffff, calldataload(local2))|[J]0xbb|local1
+undefined local4 = 0x20 + local2; // #refs 0
+goto :[J]0x154 branch:340
+")
+    class s_12 state
+  end
+  subgraph cluster_340 [pc @340]
+    s_13("pc @340 (s_13)
+=|sload(keccak256(0x0, 0x40 /*calldataload(0x24).keccak256(0x0, 0x40 /*calldataload(0x4).0x0*/)*/)/*base0[calldataload(0x4)][calldataload(0x24)]*/)|local7|local1
+memory[0x20] = 0x0;
+undefined local5 = 0xffffffffffffffffffffffffffffffffffffffff & msg.data[local2]; // #refs -1
+memory[0x0] = 0xffffffffffffffffffffffffffffffffffffffff & msg.data[local2];
+memory[0x20] = keccak256(_arg0, 0x0);
+undefined local6 = 0xffffffffffffffffffffffffffffffffffffffff & msg.data[0x20 + local2]; // #refs -1
+memory[0x0] = 0xffffffffffffffffffffffffffffffffffffffff & msg.data[0x20 + local2];
+undefined local7 = [J]0xbb; // #refs 0
+goto :[J]0xbb branch:187
+")
+    class s_13 state
+  end
+  subgraph cluster_187 [pc @187]
+    s_14("pc @187 (s_14)
+=|local7|local1
+undefined local8 = memory[0x40]; // #refs 0
+undefined local9 = allowance[_arg0][_arg1]; // #refs -1
+memory[memory[0x40]] = allowance[_arg0][_arg1];
+undefined local10 = memory[0x40]; // #refs 0
+return allowance[_arg0][_arg1];
+")
+    class s_14 state
+  end
+  s_0 -- jumpi --> s_2;
+  s_0 -. fall .-> s_1;
+  s_2 -- jumpi --> s_6;
+  s_2 -. fall .-> s_3;
+  s_3 -. fall .-> s_4;
+  s_4 -. fall .-> s_5;
+  s_7 -- jump --> s_8;
+  s_8 -- jump --> s_9;
+  s_10 -- jumpi --> s_12;
+  s_10 -. fall .-> s_11;
+  s_12 -- jump --> s_13;
+  s_13 -- jump --> s_14;
 
 ```
 
@@ -313,106 +365,159 @@ object "runtime" {
 
 ```
 
-```graphviz -opt
-digraph G {    
-  color="#efefef";
-  graph[fontsize=8];
-
-  node[shape=box style="rounded,filled" fontsize=9 fontname="Arial" fillcolor="#efefef"];
-
-  subgraph cluster_0 {
-    style="filled,rounded";
-    label = "pc @0";
-    "id-0" [label="pc @0 (id-0)\l=| local0\lmemory[0x40] = 0x80;\lundefined local0 = msg.value; // #refs 0\lwhen msg.value == 0 goto 15 or fall 11\l" fillcolor="#cf91f7"];
-  }
-
-  subgraph cluster_11 {
-    style="filled,rounded";
-    label = "pc @11";
-    "id-1" [label="pc @11 (id-1)\l=| local0\lundefined local1 = 0x0; // #refs 0\lrevert();\l" fillcolor="#cf91f7"];
-  }
-
-  subgraph cluster_15 {
-    style="filled,rounded";
-    label = "pc @15";
-    "id-2" [label="pc @15 (id-2)\l=| \lwhen msg.data.length < 0x4 goto 50 or fall 24\l" fillcolor="#cf91f7"];
-  }
-
-  subgraph cluster_24 {
-    style="filled,rounded";
-    label = "pc @24";
-    "id-3" [label="pc @24 (id-3)\l=| local1\lundefined local1 = msg.data >>> 0xe0; // #refs 1\lcase when msg.sig == 20965255 goto [J]0x37 or fall 40\l" fillcolor="#cf91f7"];
-  }
-
-  subgraph cluster_40 {
-    style="filled,rounded";
-    label = "pc @40";
-    "id-4" [label="pc @40 (id-4)\l=| local1\lcase when msg.sig == dd62ed3e goto [J]0x4f or fall 50\l" fillcolor="#cf91f7"];
-  }
-
-  subgraph cluster_50 {
-    style="filled,rounded";
-    label = "pc @50";
-    "id-5" [label="pc @50 (id-5)\l=| local1\lundefined local2 = 0x0; // #refs 0\lrevert();\l" fillcolor="#cf91f7"];
-    "id-6" [label="pc @50 (id-6)\l=| \lundefined local1 = 0x0; // #refs 0\lrevert();\l" fillcolor="#cf91f7"];
-  }
-
-  subgraph cluster_55 {
-    style="filled,rounded";
-    label = "pc @55";
-    "id-7" [label="pc @55 (id-7)\l=| [J]0x3d|local1\lgoto :[J]0x7a branch:122\l" fillcolor="#cf91f7"];
-  }
-
-  subgraph cluster_122 {
-    style="filled,rounded";
-    label = "pc @122";
-    "id-8" [label="pc @122 (id-8)\l=| sload(keccak256(local2, local4 /*caller().keccak256(local2, local4 /*caller().0x0*/)*/)/*base0[caller()][caller()]*/)|local1\lundefined local2 = 0x0; // #refs 0\lmemory[0x0] = msg.sender;\lundefined local3 = 0x20; // #refs -2\lmemory[0x20] = 0x0;\lundefined local4 = 0x40; // #refs 0\lmemory[0x20] = keccak256(msg.sender, 0x0);\lgoto :[J]0x3d branch:61\l" fillcolor="#cf91f7"];
-  }
-
-  subgraph cluster_61 {
-    style="filled,rounded";
-    label = "pc @61";
-    "id-9" [label="pc @61 (id-9)\l=| local1\lundefined local5 = 0x40; // #refs 0\lundefined local6 = memory[0x40]; // #refs -1\lmemory[memory[0x40]] = allowance[msg.sender][msg.sender];\lundefined local7 = memory[0x40]; // #refs 0\lreturn allowance[msg.sender][msg.sender];\l" fillcolor="#cf91f7"];
-    "id-10" [label="pc @61 (id-10)\l=| local8|local1\lundefined local9 = 0x40; // #refs 0\lundefined local10 = memory[0x40]; // #refs -1\lmemory[memory[0x40]] = allowance[_arg0][_arg1];\lundefined local11 = memory[0x40]; // #refs 0\lreturn allowance[_arg0][_arg1];\l" fillcolor="#cf91f7"];
-  }
-
-  subgraph cluster_79 {
-    style="filled,rounded";
-    label = "pc @79";
-    "id-11" [label="pc @79 (id-11)\l=| local3|local2|[J]0x3d|local1\lundefined local2 = 0x4; // #refs 1\lundefined local3 = msg.data.length - local2; // #refs 0\lwhen (msg.data.length - local2 < 0x40) == 0 goto 99 or fall 95\l" fillcolor="#cf91f7"];
-  }
-
-  subgraph cluster_95 {
-    style="filled,rounded";
-    label = "pc @95";
-    "id-12" [label="pc @95 (id-12)\l=| local3|local2|[J]0x3d|local1\lundefined local4 = 0x0; // #refs 0\lrevert();\l" fillcolor="#cf91f7"];
-  }
-
-  subgraph cluster_99 {
-    style="filled,rounded";
-    label = "pc @99";
-    "id-13" [label="pc @99 (id-13)\l=| and(calldataload(add(0x20, local2)), local4)|and(local4, calldataload(local2))|[J]0x3d|local1\lundefined local4 = (0x1 << 0xa0) - 0x1; // #refs 0\lgoto :[J]0x93 branch:147\l" fillcolor="#cf91f7"];
-  }
-
-  subgraph cluster_147 {
-    style="filled,rounded";
-    label = "pc @147";
-    "id-14" [label="pc @147 (id-14)\l=| sload(keccak256(local5, local7 /*calldataload(0x24).keccak256(local5, local7 /*calldataload(0x4).0x0*/)*/)/*base0[calldataload(0x4)][calldataload(0x24)]*/)|local8|local1\lundefined local5 = 0x0; // #refs 0\lundefined local6 = 0x20; // #refs -2\lmemory[0x20] = 0x0;\lmemory[0x0] = (0x1 << 0xa0) - 0x1 & msg.data[local2];\lundefined local7 = 0x40; // #refs 0\lmemory[0x20] = keccak256(_arg0, 0x0);\lmemory[0x0] = msg.data[0x20 + local2] & (0x1 << 0xa0) - 0x1;\lundefined local8 = [J]0x3d; // #refs 0\lgoto :[J]0x3d branch:61\l" fillcolor="#cf91f7"];
-  }
-
-  "id-0" -> "id-2";
-  "id-0" -> "id-1";
-  "id-2" -> "id-6";
-  "id-2" -> "id-3";
-  "id-3" -> "id-4";
-  "id-4" -> "id-5";
-  "id-7" -> "id-8";
-  "id-8" -> "id-9";
-  "id-11" -> "id-13";
-  "id-11" -> "id-12";
-  "id-13" -> "id-14";
-  "id-14" -> "id-10";
-
-}
+```mermaid -opt
+---
+title: public mapping-opt
+---
+flowchart TD
+  classDef state text-align:left
+  subgraph cluster_0 [pc @0]
+    s_0[["pc @0 (s_0)
+=|local0
+memory[0x40] = 0x80;
+undefined local0 = msg.value; // #refs 0
+when msg.value == 0 goto 15 or fall 11
+"]]
+    class s_0 state
+    style s_0 fill:#471C21
+  end
+  subgraph cluster_11 [pc @11]
+    s_1("pc @11 (s_1)
+=|local0
+undefined local1 = 0x0; // #refs 0
+revert();
+")
+    class s_1 state
+  end
+  subgraph cluster_15 [pc @15]
+    s_2("pc @15 (s_2)
+=|
+when msg.data.length < 0x4 goto 50 or fall 24
+")
+    class s_2 state
+  end
+  subgraph cluster_24 [pc @24]
+    s_3("pc @24 (s_3)
+=|local1
+undefined local1 = msg.data >>> 0xe0; // #refs 1
+case when msg.sig == 20965255 goto [J]0x37 or fall 40
+")
+    class s_3 state
+  end
+  subgraph cluster_40 [pc @40]
+    s_4("pc @40 (s_4)
+=|local1
+case when msg.sig == dd62ed3e goto [J]0x4f or fall 50
+")
+    class s_4 state
+  end
+  subgraph cluster_50 [pc @50]
+    s_5("pc @50 (s_5)
+=|local1
+undefined local2 = 0x0; // #refs 0
+revert();
+")
+    class s_5 state
+    s_6("pc @50 (s_6)
+=|
+undefined local1 = 0x0; // #refs 0
+revert();
+")
+    class s_6 state
+  end
+  subgraph cluster_55 [pc @55]
+    s_7[["pc @55 (s_7)
+=|[J]0x3d|local1
+goto :[J]0x7a branch:122
+"]]
+    class s_7 state
+    style s_7 fill:#5F021F
+  end
+  subgraph cluster_122 [pc @122]
+    s_8("pc @122 (s_8)
+=|sload(keccak256(local2, local4 /*caller().keccak256(local2, local4 /*caller().0x0*/)*/)/*base0[caller()][caller()]*/)|local1
+undefined local2 = 0x0; // #refs 0
+memory[0x0] = msg.sender;
+undefined local3 = 0x20; // #refs -2
+memory[0x20] = 0x0;
+undefined local4 = 0x40; // #refs 0
+memory[0x20] = keccak256(msg.sender, 0x0);
+goto :[J]0x3d branch:61
+")
+    class s_8 state
+  end
+  subgraph cluster_61 [pc @61]
+    s_9("pc @61 (s_9)
+=|local1
+undefined local5 = 0x40; // #refs 0
+undefined local6 = memory[0x40]; // #refs -1
+memory[memory[0x40]] = allowance[msg.sender][msg.sender];
+undefined local7 = memory[0x40]; // #refs 0
+return allowance[msg.sender][msg.sender];
+")
+    class s_9 state
+    s_10("pc @61 (s_10)
+=|local8|local1
+undefined local9 = 0x40; // #refs 0
+undefined local10 = memory[0x40]; // #refs -1
+memory[memory[0x40]] = allowance[_arg0][_arg1];
+undefined local11 = memory[0x40]; // #refs 0
+return allowance[_arg0][_arg1];
+")
+    class s_10 state
+  end
+  subgraph cluster_79 [pc @79]
+    s_11[["pc @79 (s_11)
+=|local3|local2|[J]0x3d|local1
+undefined local2 = 0x4; // #refs 1
+undefined local3 = msg.data.length - local2; // #refs 0
+when (msg.data.length - local2 < 0x40) == 0 goto 99 or fall 95
+"]]
+    class s_11 state
+    style s_11 fill:#5F021F
+  end
+  subgraph cluster_95 [pc @95]
+    s_12("pc @95 (s_12)
+=|local3|local2|[J]0x3d|local1
+undefined local4 = 0x0; // #refs 0
+revert();
+")
+    class s_12 state
+  end
+  subgraph cluster_99 [pc @99]
+    s_13("pc @99 (s_13)
+=|and(calldataload(add(0x20, local2)), local4)|and(local4, calldataload(local2))|[J]0x3d|local1
+undefined local4 = (0x1 << 0xa0) - 0x1; // #refs 0
+goto :[J]0x93 branch:147
+")
+    class s_13 state
+  end
+  subgraph cluster_147 [pc @147]
+    s_14("pc @147 (s_14)
+=|sload(keccak256(local5, local7 /*calldataload(0x24).keccak256(local5, local7 /*calldataload(0x4).0x0*/)*/)/*base0[calldataload(0x4)][calldataload(0x24)]*/)|local8|local1
+undefined local5 = 0x0; // #refs 0
+undefined local6 = 0x20; // #refs -2
+memory[0x20] = 0x0;
+memory[0x0] = (0x1 << 0xa0) - 0x1 & msg.data[local2];
+undefined local7 = 0x40; // #refs 0
+memory[0x20] = keccak256(_arg0, 0x0);
+memory[0x0] = msg.data[0x20 + local2] & (0x1 << 0xa0) - 0x1;
+undefined local8 = [J]0x3d; // #refs 0
+goto :[J]0x3d branch:61
+")
+    class s_14 state
+  end
+  s_0 -- jumpi --> s_2;
+  s_0 -. fall .-> s_1;
+  s_2 -- jumpi --> s_6;
+  s_2 -. fall .-> s_3;
+  s_3 -. fall .-> s_4;
+  s_4 -. fall .-> s_5;
+  s_7 -- jump --> s_8;
+  s_8 -- jump --> s_9;
+  s_11 -- jumpi --> s_13;
+  s_11 -. fall .-> s_12;
+  s_13 -- jump --> s_14;
+  s_14 -- jump --> s_10;
 
 ```
